app/views/recommendations/edit.html.erb

<label>Wine</label>
<%= f.collection_select :wine_id, Wine.all, :id, :name %><br>
<label>Category</label>
<%= f.collection_select :category_id, Category.all, :id, :name %><br>
---
SELECT "wines".* FROM "wines"
SELECT "categories".* FROM "categories"