app/views/recommendations/new.html.erb

<label>Choose your wine</label>
<%= f.collection_select :wine_id, Wine.all, :id, :name %><br>
<label>Choose your category</label>
<%= f.collection_select :category_id, Category.all, :id, :name %><br>
---
SELECT "wines".* FROM "wines"
SELECT "categories".* FROM "categories"