app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
---
<ul>
<% @user.reviews.each do |review| %>

SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."user_id" = ?  [["user_id", 1]]
---
<ul>
<% @user.recommendations.each do |recommendation| %>