app/controllers/application_controller.rb

  def get_logged_in_user
    @logged_in_user = User.find(logged_in_user_id) if logged_in_user_id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]