app/controllers/pairings_controller.rb

  def index
    if params[:pairing]
      arr = Pairing.all.select{|pairing| pairing.category_id == params[:pairing][:category_id].to_i }
---
SELECT "categories".* FROM "categories"
SELECT "pairings".* FROM "pairings"

  def filter_wine_group(arr,group)
    arr.select {|pairing| pairing.wine.group == group}
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]