app/controllers/recommendations_controller.rb

  def index
    @recommendations = Recommendation.all
---
SELECT "recommendations".* FROM "recommendations"

  def create
    @recommendation = Recommendation.new(recommendation_params(:comment, :wine_id, :category_id))
    @recommendation.user_id = @logged_in_user.id
    if @recommendation.save
---
INSERT INTO "recommendations" ("user_id", "category_id", "wine_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["category_id", 1], ["wine_id", 26], ["comment", "Prosecco goes with everything biatch"], ["created_at", "2018-07-11 20:24:24.818385"], ["updated_at", "2018-07-11 20:24:24.818385"]]

  def update
    if @recommendation.update(recommendation_params(:comment))
---
UPDATE "recommendations" SET "comment" = ?, "updated_at" = ? WHERE "recommendations"."id" = ?  [["comment", "Prosecco is the biatch"], ["updated_at", "2018-07-12 00:12:18.224825"], ["id", 3]]

  def destroy
    @recommendation.destroy
---
DELETE FROM "recommendations" WHERE "recommendations"."id" = ?  [["id", 1]]

  def fetch_recommendation
    @recommendation = Recommendation.find(params[:id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]