app/controllers/reviews_controller.rb

  def new
    @wine = Wine.find(params[:wine_id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]

  def create
    @wine = Wine.find(params[:wine_id])
    @review = Review.new(review_params(:title, :content))
    @review.rating = params[:rating].to_i
    @review.wine_id = params[:wine_id]
    @review.user_id = @logged_in_user.id
    if @review.save
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "content", "user_id", "wine_id", "created_at", "updated_at", "rating") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @wine = Wine.find(params[:wine_id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @wine = Wine.find(params[:wine_id])
    @review.rating = params[:rating].to_i
    if @review.update(review_params(:title, :content))
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 5], ["updated_at", "2018-07-12 18:38:46.204927"], ["id", 5]]

  def fetch_review
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]