app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit;
    @user = User.find(params[:id])

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "bradlee@fakemail.com"], ["password_digest", "$2a$10$Y.VqGvjhe089HOcpMk2F5OB2XUHLYupyCr11u3HxQGEAiPbrmUH9e"], ["updated_at", "2018-07-11 22:57:45.555468"], ["id", 1]]
---
  def update
    if @logged_in_user.update(user_params)