app/models/pairing.rb

  def self.filter_category(category)
     self.all.select {|pairing| pairing.category_id == category}
---
SELECT "pairings".* FROM "pairings"