app/views/pairings/index.html.erb

SELECT "pairings".* FROM "pairings"
SELECT "categories".* FROM "categories"
---
<label>Choose A Food Category: </label><br>
<%= collection_select(:pairing, :category_id, Category.all, :id, :name)%><br>