app/views/wines/show.html.erb

<ol>
<% @wine.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."wine_id" = ?  [["wine_id", 32]]